---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelEstimatedCurrentLabel
source: html/c08bf3b3-a85f-e1b5-be75-a9635f46222f.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelEstimatedCurrentLabel Property

The name template for the estimated current parameter on the load classification.

## Syntax (C#)
```csharp
public string PanelEstimatedCurrentLabel { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: panelEstimatedCurrentLabel is not a valid globalization format string.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null